export type BookYear = {
  year: string;
  books: string[];
  bestPick: string;
  reviewText: string;
};

export const bookListByYear: BookYear[] = [
  {
    year: "2020",
    books: ["《无人生还》", "《东方快车谋杀案》", "《ABC谋杀案》", "《尼罗河上的惨案》", "《消失的十三级台阶》"],
    bestPick: "《东方快车谋杀案》",
    reviewText:
      "阿加莎最出名的三部作之一，除了开创性的诡计谜题之外，波洛在揭露真相之后的选择，甚至远胜于后世诸多社会派推理对人性的发掘。",
  },
  {
    year: "2021",
    books: [
      "《奇风岁月》",
      "《沉默的病人》",
      "《诡计博物馆》",
      "《罗马帽子之谜》",
      "《中国橘子之谜》",
      "《希腊棺材之谜》",
      "《X的悲剧》",
      "《Y的悲剧》",
      "《Z的悲剧》",
      "《西班牙披肩之谜》",
    ],
    bestPick: "《Y的悲剧》",
    reviewText:
      "奎因兄弟以新笔名发布的新作，相较于《X的悲剧》我更喜欢这类在一个庞大家族中展开的波诡云谲。大家各有心思，各自为战，而且与阿婆的《怪屋》故事脉络相似度很高。最令人在故事结尾长出一口气的是真凶得到了应有的惩戒。",
  },
  {
    year: "2022",
    books: [
      "《字母表谜案》",
      "《傲慢与偏见》",
      "《山茶文具店》",
      "《清单人生》",
      "《哲瑞·雷恩的最后一案》",
      "《全员嫌疑人》",
      "《底牌》",
      "《狮子之家的点心日》",
      "《悬崖山庄奇案》",
      "《牙医谋杀案》",
      "《阳光下的罪恶》",
      "《人生复本》",
    ],
    bestPick: "《全员嫌疑人》",
    reviewText:
      "相较于《字母表谜案》，我更喜欢本书通过七个看似无关的小故事共同推进逐步向主角靠近的谜团。阅读起来十分轻松，不会有推理黄金时代那些作品阅读带来的紧张感。",
  },
  {
    year: "2023",
    books: ["《岁月的针脚》", "《永恒的庭院》", "《七面钟之谜》", "《同名同姓受害者协会》", "《绑架回忆》", "《外婆出租中》"],
    bestPick: "《同名同姓受害者协会》",
    reviewText:
      "我们常常会不满于一些重大社会危害案件中没有对施害者的信息公开，我们愤怒于此，却也可能忽略那些与施害者同名同姓的无辜者因此而生活被完全打扰，我们想要伸张的正义却可能是对另一无辜者的施暴。",
  },
  {
    year: "2024",
    books: ["《圣诞忆旧集》", "《鳄鱼的黄眼睛》", "《白鸟坠入密林》", "《马普尔小姐历险记》", "《蜗牛食堂》", "《三口棺材》"],
    bestPick: "《马普尔小姐历险记》",
    reviewText:
      "马普尔小姐作为阿加莎笔下几乎与波洛齐名的女性侦探，12个探案故事都是马普尔小姐这位乡村侦探在对生活细致入微的观察中，发现矛盾之处进行后续的推理。",
  },
  {
    year: "2025",
    books: ["《怪画谜案》", "《怪屋谜案》", "《如首无作祟之物》"],
    bestPick: "《如首无作祟之物》",
    reviewText:
      "三津田信三的出道作，核心诡计的展开令人头皮发麻，在整个阅读过程中给人一种酣畅淋漓的感觉。其精彩之处，只有真正阅读完才能感同身受。",
  },
];